'''Дан прямоугольник, длины сторон которого равны натуральным числам А и В.
Составить функцию, которая будет находить на сколько квадратов
можно разрезать данный прямоугольник,
 если от него каждый раз отрезать квадрат наибольшей площади.'''

def rectangle():
    A = int(input('веди сторону прямоугольника А'))
    B = int(input('веди сторону прямоугольника B'))
    print()